In [18]:
import pandas as pd

In [21]:
path='data1.csv'

In [31]:
df=pd.read_csv(path, encoding='cp949')

In [33]:
df

      학번    이름   국어   영어  수학  결측1과목  결측2과목
0  30101   최군1  100   10  50    NaN    NaN
1  30102   최군2   90   20  70    NaN    NaN
2  30103   최군3   80   30  50    NaN    5.0
3  30104   최군4   70   40  70    5.0    NaN
4  30105   최군5   60   50  50    NaN    NaN
5  30106   최군6   50   60  70    NaN    NaN
6  30107   최군7   40   70  50   10.0    NaN
7  30108   최군8   30   80  70    NaN    NaN
8  30109   최군9   20   90  50    NaN    NaN
9  30110  최군10   10  100  70    NaN  100.0

In [37]:
df.head()

      학번   이름   국어  영어  수학  결측1과목  결측2과목
0  30101  최군1  100  10  50    NaN    NaN
1  30102  최군2   90  20  70    NaN    NaN
2  30103  최군3   80  30  50    NaN    5.0
3  30104  최군4   70  40  70    5.0    NaN
4  30105  최군5   60  50  50    NaN    NaN

In [39]:
df.tail()

      학번    이름  국어   영어  수학  결측1과목  결측2과목
5  30106   최군6  50   60  70    NaN    NaN
6  30107   최군7  40   70  50   10.0    NaN
7  30108   최군8  30   80  70    NaN    NaN
8  30109   최군9  20   90  50    NaN    NaN
9  30110  최군10  10  100  70    NaN  100.0

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
학번       10 non-null int64
이름       10 non-null object
국어       10 non-null int64
영어       10 non-null int64
수학       10 non-null int64
결측1과목    2 non-null float64
결측2과목    2 non-null float64
dtypes: float64(2), int64(4), object(1)
memory usage: 688.0+ bytes

In [41]:
df.shape

(10, 7)

In [42]:
df.sample()

      학번    이름  국어   영어  수학  결측1과목  결측2과목
9  30110  최군10  10  100  70    NaN  100.0

In [44]:
df.columns

Index(['학번', '이름', '국어', '영어', '수학', '결측1과목', '결측2과목'], dtype='object')

In [45]:
df.dtypes

학번         int64
이름        object
국어         int64
영어         int64
수학         int64
결측1과목    float64
결측2과목    float64
dtype: object

In [46]:
df.isnull()

      학번     이름     국어     영어     수학  결측1과목  결측2과목
0  False  False  False  False  False   True   True
1  False  False  False  False  False   True   True
2  False  False  False  False  False   True  False
3  False  False  False  False  False  False   True
4  False  False  False  False  False   True   True
5  False  False  False  False  False   True   True
6  False  False  False  False  False  False   True
7  False  False  False  False  False   True   True
8  False  False  False  False  False   True   True
9  False  False  False  False  False   True  False

In [50]:
null_count=df.isnull().sum()

In [51]:
null_count

학번       0
이름       0
국어       0
영어       0
수학       0
결측1과목    8
결측2과목    8
dtype: int64

In [49]:
df_null_count=null_count.reset_index()

In [53]:
df_null_count

   index  0
0     학번  0
1     이름  0
2     국어  0
3     영어  0
4     수학  0
5  결측1과목  8
6  결측2과목  8

In [54]:
df_null_count.columns=['메뉴','결측']

In [62]:
df_null_count

      메뉴  결측
0     학번   0
1     이름   0
2     국어   0
3     영어   0
4     수학   0
5  결측1과목   8
6  결측2과목   8

In [66]:
df_null_count_3=df_null_count.sort_values(by='결측',ascending=False).head(2)

In [67]:
df_null_count_3

      메뉴  결측
5  결측1과목   8
6  결측2과목   8

In [68]:
drop_columns=df_null_count_3['메뉴']

In [69]:
drop_columns

5    결측1과목
6    결측2과목
Name: 메뉴, dtype: object

In [81]:
drop_columns.to_list()

['결측1과목', '결측2과목']

In [73]:
df[drop_columns]

   결측1과목  결측2과목
0    NaN    NaN
1    NaN    NaN
2    NaN    5.0
3    5.0    NaN
4    NaN    NaN
5    NaN    NaN
6   10.0    NaN
7    NaN    NaN
8    NaN    NaN
9    NaN  100.0

In [75]:
print(df.shape)

(10, 7)

In [76]:
df=df.drop(drop_columns, axis=1)

In [77]:
df

      학번    이름   국어   영어  수학
0  30101   최군1  100   10  50
1  30102   최군2   90   20  70
2  30103   최군3   80   30  50
3  30104   최군4   70   40  70
4  30105   최군5   60   50  50
5  30106   최군6   50   60  70
6  30107   최군7   40   70  50
7  30108   최군8   30   80  70
8  30109   최군9   20   90  50
9  30110  최군10   10  100  70

In [78]:
print(df.shape)

(10, 5)

In [79]:
df.head()

      학번   이름   국어  영어  수학
0  30101  최군1  100  10  50
1  30102  최군2   90  20  70
2  30103  최군3   80  30  50
3  30104  최군4   70  40  70
4  30105  최군5   60  50  50

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
학번    10 non-null int64
이름    10 non-null object
국어    10 non-null int64
영어    10 non-null int64
수학    10 non-null int64
dtypes: int64(4), object(1)
memory usage: 528.0+ bytes